Dolomonti/ESP32s3-Lawnmower/src/main.cpp
            if (key == BLADE_OFF_CMD) {
                // Blade OFF
                stopBladeSafely("Skill 6: Blade Unit OFF (Pin 19 LOW)");
            } 
            else if (key == BLADE_ON_CMD) {
                // Blade ON
                if (bladeAllowed()) {
                    currentBladeState = BLADE_WORK;
                    digitalWrite(BLADE_UNIT_PIN, HIGH);
                    current_blade_pwm = BLADE_ZERO_US;
                    DEBUG_LOG("Skill 6: Blade Unit ON (Pin 19 HIGH)");
                } else {
                    stopBladeSafely("Skill 6: Blade ON blocked - blade is UP (safety)");
                }
            } 
            else if (key >= PWM_WEB_MIN && key <= PWM_WEB_MAX) {
                // Web PWM control (21000-22000 maps to 1000-2000 PWM)
                int16_t pwmValue = key - PWM_WEB_OFFSET;
                // Validate PWM range (1000-2000 microseconds)
                if (pwmValue < 1000 || pwmValue > 2000) {
                    DEBUG_PRINTF("ERROR: PWM value %d out of valid range (1000-2000)\n", pwmValue);
                    stopBladeSafely("Skill 6: PWM out of range");
                } else if (bladeAllowed()) {
                    currentBladeState = BLADE_WORK;
                    current_blade_pwm = pwmValue;
                    DEBUG_PRINTF("Skill 6: Web-PWM-> %d PWM\n", current_blade_pwm);
                } else {
                    stopBladeSafely("Skill 6: Web-PWM blocked - blade is UP (safety)");
                }
            } 
            else if (key == KEY_BLADE_SPEED1 || key == KEY_BLADE_SPEED1_ALT) {
                // Blade Speed 1 (Working speed)
                if (bladeAllowed()) {
                    currentBladeState = BLADE_WORK;
                    current_blade_pwm = currentSettings.bladeWorkingSpeed;
                    DEBUG_PRINTF("Skill 6: Blade Speed 1 -> %d PWM\n", current_blade_pwm);
                } else {
                    stopBladeSafely("Skill 6: Blade Speed 1 blocked - blade is UP (safety)");
                }
            } 
            else if (key == KEY_BLADE_SPEED2 || key == KEY_BLADE_SPEED2_ALT) {
                // Blade Speed 2 (Stage 2 speed)
                if (bladeAllowed()) {
                    currentBladeState = BLADE_WORK;
                    current_blade_pwm = currentSettings.bladeStage2Speed;
                    DEBUG_PRINTF("Skill 6: Blade Speed 2 -> %d PWM\n", current_blade_pwm);
                } else {
                    stopBladeSafely("Skill 6: Blade Speed 2 blocked - blade is UP (safety)");
                }
            }
            break;
        }
        case SKILL_SET_BLADE_SPEEDS:
            currentSettings.bladeWorkingSpeed = param1;
            currentSettings.bladeStage2Speed = param2;
            currentSettings.bladeMaxSpeed = param3;
            currentSettings.bladeCableResetRpm = param4;
            if (!saveSettings()) {
                DEBUG_LOG("ERROR: Skill 10 - Failed to save blade speeds!");
            }
            DEBUG_PRINTF("Skill 10: Blade speeds updated - Zero: %d, Working pwm: %d, 2 Stage pwm: %d, Max pwm: %d, Reset pwm: %d\n",
                         BLADE_ZERO_US, currentSettings.bladeWorkingSpeed, currentSettings.bladeStage2Speed,
                         currentSettings.bladeMaxSpeed, currentSettings.bladeCableResetRpm);
            break;
        case SKILL_CABLE_RESET:
            DEBUG_LOG("Skill 11: Reset triggered. Stopping blade and starting sequence...");
            current_blade_pwm = BLADE_ZERO_US;
            bladeEsc.writeMicroseconds(BLADE_ZERO_US);
            currentBladeState = BLADE_CABLE_RESET;
            bladeSequenceStartTime = millis();
            if (param1 > MIN_RPM_THRESHOLD) currentSettings.bladeCableResetRpm = param1;
            DEBUG_PRINTF("Skill 11: Blade Reset Sequence started. Target: %d PWM\n",
                         currentSettings.bladeCableResetRpm);
            break;
    }
}

// ---------------------------------------------------------------------
// Sub-Handler 3: Setup & System Skills (7, 8, 9, 12-19)
// ---------------------------------------------------------------------
void handleSetupSkills(uint8_t skill, int16_t param1, int16_t param2, int16_t param3, int16_t param4, int16_t param5, int16_t param6) {
    switch (skill) {
        case SKILL_SET_LIMITS:
            if (param3 > 0) currentSettings.currentMaxSpeed = constrain(param3, 0, MAX_SPEED);
            if (param2 > 0) currentSettings.currentMaxSteer = constrain(param2, 0, MAX_STEER);
            if (!saveSettings()) {
                DEBUG_LOG("ERROR: Skill 7 - Failed to save speed/steer limits!");
            }
            DEBUG_PRINTF("Skill 7: Updated currentMaxSpeed to %d and currentMaxSteer to %d\n", currentSettings.currentMaxSpeed, currentSettings.currentMaxSteer);
            break;
        
        // ====================================================================================
        // ===== PHASE 5: HARDWARE-SICHERHEIT WARNUNG =========================================
        // ====================================================================================
        // 
        // ⚠️  WARNUNG: SKILL_ESTOP (Not-Aus) ist aktuell nur SOFTWARE-BASIERT!
        //
        // Bei einem hängenden/freezenden ESP32-Microcontroller kann die Software
        // den Motor NICHT mehr stoppen! Bei rotierenden Messern und 36V Antrieb
        // besteht Lebensgefahr!
        //
        // HARDWARE-VORAUSSETZUNG für den sicheren Betrieb:
        // EMERGENCY_STOP_PIN (GPIO 15) muss PARALLEL als physischer Unterbrecher 
        // verdrahtet werden, der direkt die Relais für BLADE_UNIT_PIN (GPIO 19)
        // und DRIVE_UNIT_PIN (GPIO 20) stromlos macht.
        //
        // EMPFOHLENE VERDRAHTUNG:
        // - E-Stop Taster als Öffner zwischen Relais-Spule und Masse schalten
        // - Oder: E-Stop Taster schaltet Hauptstromversorgung zu den Motor-Controllern
        // - Software-E-Stop (dieser Code) als zusätzliche Sicherheitsschicht
        //
        // Sicherheitsstandards: EN ISO 12100, EN 60204-1 (Not-Aus muss hardware-
        // basiert sein und den Stromkreis unterbrechen, nicht nur Signale senden)
        //
        // ====================================================================================
        case SKILL_ESTOP:
            // Config mode: Set capsize angle (param1=CONFIG_MODE_ANGLE)
            if (param1 == CONFIG_MODE_ANGLE) {
                currentSettings.capsizeAngle = (float)param2;
                if (!saveSettings()) {
                    DEBUG_LOG("ERROR: Skill 8 - Failed to save capsize angle!");
                }
                DEBUG_PRINTF("Skill 8: Capsize Angle set to %.2f degrees.\n", currentSettings.capsizeAngle);
                return;
            }
            // Config mode: Set capsize timeout (param1=CONFIG_MODE_TIMEOUT)
            if (param1 == CONFIG_MODE_TIMEOUT) {
                currentSettings.capsizeTimeout = param2;
                if (!saveSettings()) {
                    DEBUG_LOG("ERROR: Skill 8 - Failed to save capsize timeout!");
                }
                DEBUG_PRINTF("Skill 8: Capsize Timeout set to %d ms.\n", currentSettings.capsizeTimeout);
                return;
            }

