Dolomonti/ESP32s3-Lawnmower/src/main.cpp
            if (param1 == 20) {
                // Emergency stop trigger
                resetAll();
                digitalWrite(BLADE_UNIT_PIN, LOW);
                digitalWrite(DRIVE_UNIT_PIN, LOW);
                currentBladeState = BLADE_OFF;
                bladeEsc.writeMicroseconds(BLADE_ZERO_US);
                skill8SafetyActive = true;
                static unsigned long lastEstopPrint = 0;
                unsigned long now = millis();
                if (now - lastEstopPrint > 2000) {
                    DEBUG_LOG("--> IMMEDIATE EMERGENCY STOP TRIGGERED <--");
                    lastEstopPrint = now;
                }
            } else if (param1 > 0) {
                // Activate capsize monitoring
                if (!skill8Active) {
                    resetAll();
                    skill8Active = true;
                    DEBUG_LOG("Skill 8: Activated (Capsize MPU monitoring started).");
                }
            } else if (param1 == -20) {
                // Reset/stop command
                DEBUG_LOG("Stop/Reset command received: Stopping skills, resetting horizon, clearing E-Stop.");
                resetAll();
                resetHorizon();
                if (skill8SafetyActive) {
                    skill8SafetyActive = false;
                    DEBUG_LOG("--> Emergency Stop state has been cleared.");
                }
            } else if (param1 < 0) {
                // Deactivate capsize monitoring
                if (skill8Active) {
                    skill8Active = false;
                    hoverboardInverted = false;
                    skill8SafetyActive = false;
                    DEBUG_LOG("Skill 8: Deactivated (Capsize MPU monitoring stopped).");
                }
            } else {
                DEBUG_LOG("Skill 8: Undefined command, requires a non-zero value.");
            }
            break;
        case SKILL_REBOOT:
            DEBUG_LOG("Skill 9 triggered via Webpage. Restarting ESP32...");
            ESP.restart();
            break;
        case SKILL_DRIVE_LEVELS:
            currentSettings.driveMinShutdownVoltage = param1;
            currentSettings.driveSafetyModeVoltage = param2;
            currentSettings.driveHighVoltage = param3;
            currentSettings.driveEmergencyLowTemp = param4;
            currentSettings.driveSafetyModeTemp = param5;
            currentSettings.driveHighTemp = param6;
            if (!saveSettings()) {
                DEBUG_LOG("ERROR: Skill 12 - Failed to save drive levels!");
            }
            DEBUG_PRINTF("Skill 12: Drive settings updated - V: %d, %d, %d | Temp: %d, %d, %d\n",
                         currentSettings.driveMinShutdownVoltage, currentSettings.driveSafetyModeVoltage,
                         currentSettings.driveHighVoltage, currentSettings.driveEmergencyLowTemp,
                         currentSettings.driveSafetyModeTemp, currentSettings.driveHighTemp);
            break;
        case SKILL_BLADE_LEVELS:
            currentSettings.bladeMinShutdownVoltage = param1;
            currentSettings.bladeSafetyModeVoltage = param2;
            currentSettings.bladeHighVoltage = param3;
            currentSettings.bladeEmergencyLowTemp = param4;
            currentSettings.bladeSafetyModeTemp = param5;
            currentSettings.bladeHighTemp = param6;
            if (!saveSettings()) {
                DEBUG_LOG("ERROR: Skill 13 - Failed to save blade levels!");
            }
            DEBUG_PRINTF("Skill 13: Blade settings updated - V: %d, %d, %d | Temp: %d, %d, %d\n",
                         currentSettings.bladeMinShutdownVoltage, currentSettings.bladeSafetyModeVoltage,
                         currentSettings.bladeHighVoltage, currentSettings.bladeEmergencyLowTemp,
                         currentSettings.bladeSafetyModeTemp, currentSettings.bladeHighTemp);
            break;
        case SKILL_CAPSIZE_PARAMS:
            currentSettings.capsizeAngle = (float)param1;
            currentSettings.capsizeTimeout = param2;
            if (!saveSettings()) {
                DEBUG_LOG("ERROR: Skill 14 - Failed to save capsize parameters!");
            }
            DEBUG_PRINTF("Skill 14: Capsize parameters updated - Angle: %.2f, Timeout: %d\n",
                         currentSettings.capsizeAngle, currentSettings.capsizeTimeout);
            break;
        case SKILL_PD_GAINS:
            // Validate PD gains (reasonable range: 0.01 to 10.0)
            if (param1 > 0) {
                float kp = (float)param1 / 100.0f;
                if (kp > 10.0f) {
                    DEBUG_PRINTF("WARNING: Kp %.2f exceeds max 10.0, clamping.\n", kp);
                    kp = 10.0f;
                }
                currentSettings.Kp = kp;
            }
            if (param2 > 0) {
                float kd = (float)param2 / 100.0f;
                if (kd > 10.0f) {
                    DEBUG_PRINTF("WARNING: Kd %.2f exceeds max 10.0, clamping.\n", kd);
                    kd = 10.0f;
                }
                currentSettings.Kd = kd;
            }
            if (!saveSettings()) {
                DEBUG_LOG("ERROR: Skill 15 - Failed to save PD gains!");
            }
            DEBUG_PRINTF("Skill 15: PD-Regler aktualisiert - Kp: %.2f, Kd: %.2f\n", currentSettings.Kp, currentSettings.Kd);
            break;
        case SKILL_BLADE_BATTERY_FACTOR:
            if (param1 > 0) {
                float factor = (float)param1 / 100.0f;
                // Validate factor (reasonable range: 1.0 to 50.0)
                if (factor < 1.0f || factor > 50.0f) {
                    DEBUG_PRINTF("WARNING: Blade battery factor %.2f outside valid range (1.0-50.0)\n", factor);
                }
                currentSettings.bladeBatteryFactor = factor;
                if (!saveSettings()) {
                    DEBUG_LOG("ERROR: Skill 16 - Failed to save blade battery factor!");
                }
                DEBUG_PRINTF("Neuer Blade Batterie Faktor: %.2f\n", currentSettings.bladeBatteryFactor);
            }
            break;
        case SKILL_DRIVE_BATTERY_FACTOR:
            if (param1 > 0) {
                float factor = (float)param1 / 1000.0f;
                // Validate factor (reasonable range: 0.5 to 5.0)
                if (factor < 0.5f || factor > 5.0f) {
                    DEBUG_PRINTF("WARNING: Drive battery factor %.3f outside valid range (0.5-5.0)\n", factor);
                }
                currentSettings.driveBatteryFactor = factor;
                if (!saveSettings()) {
                    DEBUG_LOG("ERROR: Skill 17 - Failed to save drive battery factor!");
                }
                DEBUG_PRINTF("Neuer Drive Faktor: %.3f\n", currentSettings.driveBatteryFactor);
            }
            break;
        case SKILL_DRIVE_POWER:
            if (param1 > 0) {
                digitalWrite(DRIVE_UNIT_PIN, HIGH);
                DEBUG_LOG("Skill 18: Drive Unit Power ON (Pin 20 HIGH)");
            } else {
                digitalWrite(DRIVE_UNIT_PIN, LOW);
                DEBUG_LOG("Skill 18: Drive Unit Power OFF (Pin 20 LOW)");
            }
            break;
        case SKILL_HOVERBOARD_PARAMS:
            global_cmdCode = (uint16_t)param1;
            global_accel = (uint16_t)param2;
            global_brake = (uint16_t)param3;
            DEBUG_PRINTF("Skill 19: Parameters updated -> Cmd: %d, Accel: %d, Brake: %d\n",
                         global_cmdCode, global_accel, global_brake);
            break;
    }
}

// ---------------------------------------------------------------------
// HAUPT-VERTEILER (Der Ersatz für das Spaghetti-Monster)
// ---------------------------------------------------------------------
void triggerSkill(uint8_t skill, int16_t param1 = 0, int16_t param2 = 0, int16_t param3 = 0, int16_t param4 = 0, int16_t param5 = 0, int16_t param6 = 0) {
    // Validate skill code (0 and >20 are reserved/invalid, except 255)
    if (skill == SKILL_NONE) {
        DEBUG_LOG("WARNING: Skill 0 (none) triggered - ignoring.");
        return;
    }
    if (skill > SKILL_DISTANCE_MISSION && skill != SKILL_HEARTBEAT) {
        DEBUG_PRINTF("WARNING: Invalid skill code %d - ignoring.\n", skill);
        return;
    }
    
    // Verteile Skills an die entsprechenden Handler
    if (skill <= SKILL_TURN_180 || skill == SKILL_DISTANCE_MISSION) {
        // Drive & Movement Skills: 0-4, 20
        handleDriveSkills(skill, param1, param2, param3, param4, param5, param6);
    } else if (skill == SKILL_BLADE_LIFT || skill == SKILL_BLADE_CONTROL || 
               skill == SKILL_SET_BLADE_SPEEDS || skill == SKILL_CABLE_RESET) {
        // Blade & Actuator Skills: 5, 6, 10, 11
        handleBladeSkills(skill, param1, param2, param3, param4);
    } else {
        // Setup & System Skills: 7-9, 12-19, 255
        handleSetupSkills(skill, param1, param2, param3, param4, param5, param6);
    }
}

// Send() ist jetzt in HoverboardComm.cpp (To-Do 7: Vollständige Modularisierung)
void sendESPNow(uint8_t *mac, ESPNowCommand *command) {
    esp_err_t result;

    // Set start frame
    command->start = START_FRAME;

