Dolomonti/ESP32s3-Lawnmower/src/main.cpp
  // If giving the semaphore woke up a task with a higher priority than the one
  // currently running, we must force a context switch.
  if (xHigherPriorityTaskWoken) {
    portYIELD_FROM_ISR();
  }
}

// Phase 4.5: setupWiFiAP() ist jetzt in NetworkManager.cpp

// =========================================================
// --- VOLLSTÄNDIGE BLADE CONTROL LOGIC (STABILISIERT) ---
// =========================================================
void runBladeLogic() {
    static unsigned long lastPwmUpdate = 0;
    unsigned long currentMillis = millis();

    // 1. TAKTUNG: Logik und PWM-Ausgabe nur alle 20ms
    if (currentMillis - lastPwmUpdate < 20) return; 
    lastPwmUpdate = currentMillis;

    // 2. SICHERHEITS-CHECK
    if (skill8SafetyActive || isInSafetyMode) {
        currentBladeState = BLADE_OFF;
    }

    // 3. STATE MACHINE
    switch (currentBladeState) {
        case BLADE_OFF:
            current_blade_pwm = BLADE_ZERO_US; 
            if (bladeEsc.attached()) bladeEsc.detach(); 
            digitalWrite(BLADE_ESC_PIN, LOW);                 
            break;

        case BLADE_WORK:
            if (!bladeEsc.attached()) {
                bladeEsc.attach(BLADE_ESC_PIN, 1000, 2000);
            }
            break;

        case BLADE_CABLE_RESET:
            // Sobald Energie für das Messer gebraucht wird, Pin 20 hochziehen
            if (digitalRead(BLADE_UNIT_PIN) == LOW) {
                digitalWrite(BLADE_UNIT_PIN, HIGH);
                DEBUG_LOG("Blade Logic: Unit Power ON (Pin 20)");
            }
            
            if (!bladeEsc.attached()) {
                bladeEsc.attach(BLADE_ESC_PIN, 1000, 2000);
            }
           

            unsigned long timeInSeq = currentMillis - bladeSequenceStartTime;
            int targetPwm = currentSettings.bladeCableResetRpm;
            if (targetPwm <= 1500) targetPwm = 1600; 

            if (timeInSeq <= RESET_RAMP_MS) {
                float progress = (float)timeInSeq / (float)RESET_RAMP_MS;
                int range = targetPwm - BLADE_ZERO_US;
                current_blade_pwm = BLADE_ZERO_US + (int)(progress * (float)range);
            }
            else if (timeInSeq <= (RESET_RAMP_MS + RESET_HOLD_MS)) {
                current_blade_pwm = targetPwm;
            }
            else {
                current_blade_pwm = BLADE_ZERO_US;
                currentBladeState = BLADE_WORK;
                DEBUG_LOG("Blade Reset Sequence finished.");
            }
            break;
    }

    // 4. HARDWARE-AUSGABE
    if (bladeEsc.attached() && currentBladeState != BLADE_OFF) {
        int pulse = current_blade_pwm;
        if (pulse > 2000) pulse = 2000;
        if (pulse < 1000) pulse = 1000;
        
        bladeEsc.writeMicroseconds(pulse);
    }
} 

void setup() {
    Serial.begin(SERIAL_BAUD);

    // *** SICHERHEIT: SerialFeedback Struct-Größe prüfen ***
    if (sizeof(SerialFeedback) != 18) {
        Serial.printf("FATAL: SerialFeedback struct size is %d, expected 18!\n", sizeof(SerialFeedback));
        // In Entwicklung: endlos warten um Fehler zu sehen
        // In Produktion: trotzdem starten aber loggen
    }

    // *** NOT-AUS Pin Initialisierung ***
    pinMode(EMERGENCY_STOP_PIN, INPUT_PULLUP); // Emergency stop button, active LOW

    pinMode(BLADE_UP_PIN, OUTPUT);   // Nutzt jetzt Pin 35
    pinMode(BLADE_DOWN_PIN, OUTPUT); // Nutzt jetzt Pin 36
    digitalWrite(BLADE_UP_PIN, LOW);
    digitalWrite(BLADE_DOWN_PIN, LOW);

    // --- Blade ESC Initialisierung ---
    // Standard ESC: 1000us = 0%, 2000us = 100%
    bladeEsc.attach(BLADE_ESC_PIN, 1000, 2000);
    bladeEsc.writeMicroseconds(BLADE_ZERO_US); // Motor sicher auf AUS stellen

    pinMode(BLADE_UNIT_PIN, OUTPUT);
    digitalWrite(BLADE_UNIT_PIN, LOW);   // Pin 19 auf LOW beim Start

    pinMode(DRIVE_UNIT_PIN, OUTPUT);
    digitalWrite(DRIVE_UNIT_PIN, LOW);   // Pin 20 auf LOW beim Start

    if (ENABLE_DEBUG_SERIAL) {
        debugPrintln("Blade ESC initialized on Pin 4.");
        debugPrintln("Blade Unit (19) and Drive Unit (20) initialized as LOW.");
    }

    // Phase 1.2: Initialize NVS and load settings
    loadSettings();

    // Initialize peer tracking structure
    unsigned long currentMillis = millis();
    for (int i = 0; i < numberOfPeers; i++) {
        peers[i].isConnected = false;
        peers[i].lastSeen = currentMillis;
        peers[i].reconnectAttempts = 0;
        peers[i].lastReconnectAttempt = 0;
    }

    // Read Wi-Fi credentials from EEPROM
    readWiFiCredentialsFromNVS();

    // 1. WiFi-Hardware resetten (verhindert Channel-Konflikte mit ESP-NOW)
    WiFi.disconnect(true); 
    vTaskDelay(100 / portTICK_PERIOD_MS);
    
    // 1. AP starten (Erzwingt Kanal 6)
    setupWiFiAP();

    // 2. Heimnetzwerk verbinden (Wieder aktiviert!)
    // Wir nutzen connectToWiFi, da diese Funktion wartet, bis die Verbindung steht.
    if (strlen(stored_ssid) > 0 && isprint(stored_ssid[0])) { // Prüfung auf > 0 (nicht 1)
        DEBUG_PRINTF("[Setup] Gespeicherte SSID gefunden: %s\n", stored_ssid);
        DEBUG_LOG("[Setup] Starte Verbindung zum Heimnetz...");
        connectToWiFi(stored_ssid, stored_password);
    } else {
        DEBUG_LOG("[Setup] Keine WiFi-Daten im Speicher gefunden.");
    }



    // Print WiFi channel information
    DEBUG_PRINTF("Current WiFi Channel: %d | Mode: %s\n",
        WiFi.channel(),
        WiFi.getMode() == WIFI_MODE_AP ? "AP" :
        WiFi.getMode() == WIFI_MODE_STA ? "STA" :
        WiFi.getMode() == WIFI_MODE_APSTA ? "AP+STA" : "Unknown");

    delay(100);


    pinMode(LED_BUILTIN, OUTPUT);

    xTaskCreatePinnedToCore(
            core1WiFiTask,
            "WiFiTask",
            10000,
            NULL,
            5,    
            NULL,
            1
        );

    // Initialize ESP-NOW
    if (esp_now_init() != ESP_OK) {
        debugPrintln("Error initializing ESP-NOW");
        return;
    }
    DEBUG_LOG("ESP-NOW Initialized");

    espNowMutex = xSemaphoreCreateMutex();
    if (espNowMutex == NULL) {
        debugPrintln("Failed to create ESP-NOW mutex");
    }


    // Add peers
    esp_now_peer_info_t peerInfo = {};
    for (int i = 0; i < numberOfPeers; i++) {
        const uint8_t *macAddress = deviceList[i].mac;

        memset(&peerInfo, 0, sizeof(peerInfo));
        memcpy(peerInfo.peer_addr, macAddress, 6);
        peerInfo.channel = 6; // 0 means use current channel
        peerInfo.encrypt = false;

        if (esp_now_add_peer(&peerInfo) != ESP_OK) {
            debugPrintf("Failed to add peer %d\n", i);
        } else {
            DEBUG_PRINTF("Added peer %d successfully\n", i);
        }
    }


  pinMode(BUTTON1_PIN, INPUT_PULLUP);
  pinMode(BUTTON2_PIN, INPUT_PULLUP);
  pinMode(BLADE_BATTERY_PIN, INPUT);

