Dolomonti/ESP32s3-Lawnmower/src/main.cpp
      // Check against deviceList
      for (int i = 0; i < sizeof(deviceList) / sizeof(deviceList[0]); i++) {
          if (memcmp(selfMacAddress, deviceList[i].mac, 6) == 0) {
              deviceID = deviceList[i].id;
              if (ENABLE_DEBUG_SERIAL) {
                debugPrint("Device ID assigned: ");
                debugPrintln(deviceID);
              }
              break;
          }
      }

      if (deviceID == -1) {
          debugPrintln("Error: Device ID not found in device list. Please update deviceList.");
          // Optionally, handle this case gracefully:
          // Initialize as a default ID or perform additional setup.
      }



      xTaskCreatePinnedToCore(
        heartbeatTask,        // Task function
        "HeartbeatTask",      // Task name
        4096,                  // Stack size
        NULL,                  // Parameters
        0,                     // Priority 
        &heartbeatTaskHandle, // Task handle
        0                      // Core 0
    );

    xTaskCreatePinnedToCore(
        espNowTask,
        "ESPNowTask",
        4096,
        NULL,
        5,                    
        NULL,
        0                      
    );

    
    xTaskCreatePinnedToCore(statusTask, "StatusTask", 4096, NULL, 2, NULL, 0); // Prio 2, Kern 0
    
    // Task für die reine Fahr-Logik (Absolute Priorität auf Kern 1)
    xTaskCreatePinnedToCore(controlLogicTask, "ControlTask", 4096, NULL, 4, NULL, 1);
    
    // Task 5.5: EEPROM Speicher-Task (niedrige Priorität, Core 0)
    xTaskCreatePinnedToCore(nvsSaveTask, "NvsTask", 2048, NULL, 1, NULL, 0); // Phase 1.2: NVS statt EEPROM

    // Letzter Befehl: Kanal 6 erzwingen, falls WiFi.begin() ihn verstellt hat
    vTaskDelay(200 / portTICK_PERIOD_MS);
    esp_wifi_set_promiscuous(true);
    esp_wifi_set_channel(6, WIFI_SECOND_CHAN_NONE);
    esp_wifi_set_promiscuous(false);

    ArduinoOTA.setHostname("Lawnmower-ESP32");
    ArduinoOTA.setPassword("1234"); // Setzt dein gewünschtes Passwort
    
    
    ArduinoOTA.onStart([]() {
        String type = (ArduinoOTA.getCommand() == U_FLASH) ? "sketch" : "filesystem";
        
        // 1. Kompletter System-Stopp (entspricht deinem Skill 1)
        resetAll(); // Stoppt alle Skills und setzt Steer/Speed intern zurück
        resetHorizon(); // Kalibriert Gyro neu
        
        // 2. Sicherheit für Hardware
        Send(0, 0); // Schickt sofort 0/0 an das Hoverboard
        currentBladeState = BLADE_OFF; // Messer hart 
        digitalWrite(BLADE_UNIT_PIN, LOW); // Hardware-Lock
        
        // 3. MPU/I2C Entlastung
        // Wir setzen skill8Active auf false, damit mpuReadTask keine Logik mehr ausführt
        skill8Active = false; 
        
        debugPrintln("OTA Update Start: " + type + " - System in Safety Idle.");
    });

    ArduinoOTA.onEnd([]() {
        debugPrintln("\nUpdate erfolgreich beendet. Starte neu...");
    });

    ArduinoOTA.onError([](ota_error_t error) {
        debugPrintf("OTA Fehler [%u]\n", error);
        // Bei Fehler: Skill 8 wieder an, damit der Mäher nicht ungeschützt bleibt
        skill8Active = true; 
    });

    ArduinoOTA.begin();
    debugPrintln("OTA Service ready (1.9MB Mode)");
}

// =========================================================
// --- VOLLSTÄNDIGE CONTROL LOGIC TASK (60s TIMER & OVERRIDE) ---
// =========================================================
// =========================================================
// --- VOLLSTÄNDIGE CONTROL LOGIC TASK (60s TIMER & OVERRIDE) ---
// =========================================================
void controlLogicTask(void *pvParameters) {
    TickType_t xLastWakeTime = xTaskGetTickCount();
    const unsigned long JOYSTICK_TIMEOUT = 5000;
    
    // Status-Variablen für den Handshake
    static bool missionRequestSent = false; 
    static bool missionTriggeredOnce = false;

    for (;;) {
        // *** CRITICAL FIX: Reset flags wenn neue Mission startet ***
        if (resetMissionFlags) {
            missionRequestSent = false;
            missionTriggeredOnce = false;
            resetMissionFlags = false;
            DEBUG_LOG(">> MISSION FLAGS RESET");
        }

        int16_t taskSteer = 0;
        int16_t taskSpeed = 0;
        bool shouldSend = true; 

        // ---------------------------------------------------------
        // 1. MISSIONSLOGIK (Skill 20 / Distanzfahrt)
        // ---------------------------------------------------------
        if (skillActive && currentSkill == 20) {
            
            // *** KRITISCH: E-Stop hat VORRANG vor Mission ***
            if (skill8SafetyActive) {
                skillActive = false;
                currentSkill = 0;
                global_cmdCode = 0;
                missionTriggeredOnce = false;
                missionRequestSent = false;
                resetAll();
                shouldSend = false;
                DEBUG_LOG(">> MISSION ABORT: E-Stop (Skill 8) triggered!");
            }
            // A. Sicherheit: Manueller Abbruch NUR durch echte Joystick-Bewegung
            // input_EspNowSpeed enthält hier 300 (Mission), input_JoySpeed enthält 0.
            if (abs(input_JoySpeed) > 100 || abs(input_JoySteer) > 100) {
                skillActive = false; 
                global_cmdCode = 0;
                missionTriggeredOnce = false;
                missionRequestSent = false;
                shouldSend = true; 
                DEBUG_LOG(">> MISSION ABORT: Real Joystick Override detected.");
            }
            else {
                // B. MISSIONS-START: Befehl genau EINMAL senden
                if (!hoverboardIsBusy && !missionTriggeredOnce && !missionRequestSent) {
                    global_cmdCode = 2;
                    Send(input_EspNowSteer, input_EspNowSpeed); 
                    
                    missionRequestSent = true; 
                    shouldSend = false;        
                    DEBUG_LOG(">> MISSION START: One-Shot Sent. Waiting for ACK...");
                }
                // C. WARTEMODUS: ESP32 schweigt und wartet auf die Busy-Flagge vom STM32
                else if (missionRequestSent && !hoverboardIsBusy && !missionTriggeredOnce) {
                    shouldSend = false; 
                }
                // D. MISSION LÄUFT: STM32 hat die Flagge gesetzt
                else if (hoverboardIsBusy) {
                    shouldSend = false; 
                    missionTriggeredOnce = true; 
                }
                // E. ZIEL ERREICHT: STM32 meldet Ende der Fahrt (Busy wieder false)
                else if (!hoverboardIsBusy && missionTriggeredOnce) {
                    skillActive = false;
                    currentSkill = 0;
                    global_cmdCode = 0;
                    missionTriggeredOnce = false;
                    missionRequestSent = false; 
                    shouldSend = true; 
                    DEBUG_LOG(">> MISSION DONE: Target reached.");
                }
                else {
                    shouldSend = false; 
                }
            }
        }

        // ---------------------------------------------------------
        // 2. MANUELLE STEUERUNG (Nur wenn keine Mission aktiv ist)
        // ---------------------------------------------------------
        if (!skillActive || currentSkill != 20) {
            if (monitorDirection || holdLine) {
                taskSteer = skillSteer;
                taskSpeed = input_EspNowSpeed;
            } 
            else {
                taskSteer = input_EspNowSteer;
                taskSpeed = input_EspNowSpeed;
            }

            if (lastJoystickCommandTime > 0 && (millis() - lastJoystickCommandTime > JOYSTICK_TIMEOUT)) {
                if (!holdLine) taskSteer = 0;
                taskSpeed = 0;
            }

            if (!digitalRead(BUTTON1_PIN)) { taskSpeed = 200; taskSteer = 0; } 
            else if (!digitalRead(BUTTON2_PIN)) { taskSpeed = -200; taskSteer = 0; }

