Dolomonti/ESP32s3-Lawnmower/src/main.cpp
// ========================================================
//          Wi-Fi Connection
// ========================================================
void connectToWiFi(const char* ssid, const char* password) {
    int maxRetries = 3;
    int retryCount = 0;
    unsigned long retryDelay = 5000;
    bool connected = false;

    while (retryCount < maxRetries && !connected) {
        if (ENABLE_DEBUG_SERIAL) {
          debugPrint("Connecting to ");
          debugPrintln(ssid);
        }
        { char buf[64]; snprintf(buf, sizeof(buf), "Connecting to %s", ssid); logToWebpage(buf); }

        // Phase 3: DHCP statt statischer IP (für flexible Netzwerk-Kompatibilität)
        // WiFi.config() entfernt - DHCP wird automatisch verwendet
        WiFi.begin(ssid, password);
        unsigned long startAttemptTime = millis();

        while (WiFi.status() != WL_CONNECTED && millis() - startAttemptTime < 10000) {
            vTaskDelay(500 / portTICK_PERIOD_MS);
            if (ENABLE_DEBUG_SERIAL) {
              debugPrint(".");
            }
        }


        if (WiFi.status() == WL_CONNECTED) {
            if (ENABLE_DEBUG_SERIAL) {
              debugPrintln("Connected successfully!");
              debugPrint("IP address: ");
              debugPrintln(WiFi.localIP());
            }
            logToWebpage("Connected successfully!");
            { char buf[64]; snprintf(buf, sizeof(buf), "IP address: %s", WiFi.localIP().toString().c_str()); logToWebpage(buf); }
            isWiFiConnected = true;
            apStartTime = millis();
            connected = true;
        } else {
            retryCount++;
            debugPrintln("Failed to connect. Retrying...");
            { char buf[128]; snprintf(buf, sizeof(buf), "Failed to connect. Retrying... (%d/%d)", retryCount, maxRetries); logToWebpage(buf); }
            delay(retryDelay);
        }
    }

    if (!connected) {
        debugPrintln("Failed to connect after multiple attempts.");
        logToWebpage("Failed to connect after multiple attempts.");
    }
}


// ========================================================
// WebSocket Log Function
// ========================================================
// This function sends log messages to all connected WebSocket clients.
// It is used to mirror the ESP32 serial monitor output to the webpage.


// Add logic here for what should happen when the resetDevice function is triggered
void resetDevice(AsyncWebServerRequest *request) {
    if (ENABLE_DEBUG_SERIAL) {
      debugPrintln("Resetting device...");
    }
    logToWebpage("Resetting device...");
    request->send(200, "text/plain", "Device is restarting.");
    // *** TASK 1.3: Blockierenden Code durch Flag ersetzt ***
    shouldRestart = true;
}

// Add this new function to handle the WiFi reset request
void handleResetWifi(AsyncWebServerRequest *request) {
    if (ENABLE_DEBUG_SERIAL) {
      debugPrintln("Resetting WiFi credentials in EEPROM...");
    }
    logToWebpage("Resetting WiFi credentials in EEPROM...");
    // Write empty strings to the credential memory locations
    writeWiFiCredentialsToNVS("", "");
    request->send(200, "text/plain", "WiFi credentials reset. Please restart the device.");
    logToWebpage("WiFi credentials have been reset on the device. A restart is required to apply the changes.");
}


// ====================================================================================
// ===== AFTER: Optimierte Receive Funktion mit Flag-Check & Erweitertem Debug ========
// ====================================================================================
// Receive() ist jetzt in HoverboardComm.cpp (To-Do 7: Vollständige Modularisierung)
// ########################## LOOP ##########################

void loop(void)
{
    // 1. System-Neustart (falls über Web getriggert)
    if (shouldRestart) {
        delay(100);
        ESP.restart();
    }

    // 2. Daten vom Hoverboard empfangen
    Receive();

    // 3. Sicherheits-Checks & Status-Berechnung
    // Batteriespannung korrigieren (expliziter Cast für Typensicherheit)
    corrected_batVoltage = (int16_t)(Feedback.batVoltage * currentSettings.driveBatteryFactor);

    // Board-Temperatur mit Offset berechnen
    float rectangleCorrectedBoardTemp = Feedback.boardTemp + 37.6f;

    // Systemstatus prüfen (Spannung/Temp Limits) - Phase 3: Removed unused params
    handleSystemStatus(corrected_batVoltage, rectangleCorrectedBoardTemp);

    // 4. ESP-NOW & Peer Management
    managePeers();

    // 5. Konsolen-Eingaben (USB) verarbeiten
    handleSerialInput();

    // 6. & 7. Fahrlogik & Hoverboard-Send
    // Diese Logik wurde vollständig in die 'controlLogicTask' auf Core 1 ausgelagert.
    // Das garantiert ein stabiles 30ms Sende-Intervall, unabhängig von der CPU-Last.
    
    // Wir aktualisieren hier nur noch die Variablen für die Web-Anzeige
    // 8. Web Log Timer (Log-Daten an Website schicken alle 500ms)
        if (webLogActive && (millis() - lastWebLogSend > 500)) {        lastWebLogSend = millis();
        if (webLogHasData()) {
            // Phase 1.1: Ringpuffer auslesen und senden
            char logOutput[WEB_LOG_BUFFER_SIZE];
            getFromWebLogBuffer(logOutput, sizeof(logOutput));
            if (strlen(logOutput) > 0) {
                char prefixed[WEB_LOG_BUFFER_SIZE + 10];
                snprintf(prefixed, sizeof(prefixed), "LOG:%s", logOutput);
                ws.textAll(prefixed);
            } 
        }
    }

    // 9. Mähwerk-Logik (Blade)
    runBladeLogic();

    ArduinoOTA.handle(); // Prüft ständig, ob ein neues Update über WLAN reinkommt

    // 10. Kurze Pause für Hintergrundprozesse
    vTaskDelay(10 / portTICK_PERIOD_MS);
}

void mpuReadTask(void *parameter) {
  DEBUG_LOG("MPU Reading Task (Core 0) started.");
  
  for (;;) {
    // Erhöhter Timeout für Semaphore, um auf ISR zu warten
    if (xSemaphoreTake(mpuSemaphore, pdMS_TO_TICKS(100)) == pdTRUE) {
      if (xSemaphoreTake(i2cMutex, pdMS_TO_TICKS(10)) == pdTRUE) {
        
