Dolomonti/ESP32s3-Lawnmower/src/main.cpp
        fifoCount = mpu.getFIFOCount();
        
        // Wenn der Puffer zu voll wird (> 500 Bytes), ist er "veraltet". 
        // Wir löschen ihn komplett für frische Daten.
        if (fifoCount == 1024 || fifoCount > 500) {
          mpu.resetFIFO();
        } 
        else {
          // Wir lesen nur das aktuellste Paket und verwerfen den Rest im Puffer schnell,
          // um Latenz zu vermeiden (Real-Time Orientierung).
          while (fifoCount >= packetSize) {
            mpu.getFIFOBytes(fifoBuffer, packetSize);
            fifoCount -= packetSize;
          }

          // Nur das letzte (aktuellste) Paket verarbeiten
          mpu.dmpGetQuaternion(&q, fifoBuffer);
          mpu.dmpGetGravity(&gravity, &q);
          mpu.dmpGetYawPitchRoll(ypr, &q, &gravity);

          yaw   = 2.0f * ((ypr[0] * 180 / M_PI) - yawOffset);
          pitch = (ypr[1] * 180 / M_PI) - pitchOffset;
          roll  = (ypr[2] * 180 / M_PI) - rollOffset;

          if (yaw > 180)  yaw -= 360;
          if (yaw < -180) yaw += 360;

          if (skill8Active) {
              monitorSkill8Angles(pitch, roll);
              if (monitorDirection) monitorDirectionChange(yaw);
              if (holdLine && (millis() - case3StartTime >= 500)) holdTheLine(yaw);
          }
        }
        xSemaphoreGive(i2cMutex);
      }
    }
    // Task-Delay reduzieren für schnellere Reaktion (Core 0 hat Zeit)
    vTaskDelay(pdMS_TO_TICKS(5)); 
  } 
}


// ========================================================
void handleSystemStatus(int16_t battery, int16_t temp) {

    static unsigned long driveHighVoltTime = 0;
    static unsigned long driveLowVoltTime = 0;
    static unsigned long driveTempErrorTime = 0;
    static unsigned long bladeVoltErrorTime = 0;

    unsigned long now = millis();

    // 1. DRIVE SYSTEM MONITORING (Hoverboard)
    if (battery > 0) {
        // A. Überspannung Drive
        if (battery > currentSettings.driveHighVoltage) {
            if (driveHighVoltTime == 0) driveHighVoltTime = now;
            if (now - driveHighVoltTime > SAFETY_TRIGGER_DELAY && !isHighVoltageShutdown) {
                isHighVoltageShutdown = true;
                debugPrintln("!!! SHUTDOWN: Drive High Voltage (Persistent)!");
                triggerSkill(8, 20);
            }
        } else { driveHighVoltTime = 0; }

        // B. Kritische Unterspannung Drive
        if (battery < currentSettings.driveMinShutdownVoltage) {
            if (driveLowVoltTime == 0) driveLowVoltTime = now;
            if (now - driveLowVoltTime > SAFETY_TRIGGER_DELAY) {
                Send(0, 0);
                debugPrintln("!!! STOP: Drive Battery Critically Low!");
            }
        } else { driveLowVoltTime = 0; }

        // C. Safety Mode (Warnung/Drosselung - ohne Delay für sofortige Reaktion)
        if (battery < currentSettings.driveSafetyModeVoltage && battery >= currentSettings.driveMinShutdownVoltage) {
            if (!isInSafetyMode) {
                isInSafetyMode = true;
                originalMaxSpeed = currentSettings.currentMaxSpeed;
                currentSettings.currentMaxSpeed /= 2;
                triggerSkill(6, -1);
                debugPrintln("!! SAFETY MODE: Low Drive Battery - Blade OFF");
            }
        } else if (battery >= currentSettings.driveSafetyModeVoltage && isInSafetyMode) {
            // Automatischer Reset des Safety Modes, wenn Spannung wieder OK
            isInSafetyMode = false;
            currentSettings.currentMaxSpeed = originalMaxSpeed;
            debugPrintln("SYSTEM: Drive Voltage restored. Normal speed.");
        }
    }

    // 2. DRIVE TEMPERATURE CHECK
    if (temp > -100) { 
        if (temp > currentSettings.driveHighTemp || (temp != 0 && temp < currentSettings.driveEmergencyLowTemp)) {
            if (driveTempErrorTime == 0) driveTempErrorTime = now;
            if (now - driveTempErrorTime > SAFETY_TRIGGER_DELAY) {
                debugPrintf("!!! SHUTDOWN: Drive Temp Error Persistent: %d\n", temp);
                triggerSkill(8, 20);
            }
        } else { driveTempErrorTime = 0; }
    }

    // 3. BLADE SYSTEM MONITORING (Zusatz-Akku) - Integriert in handleSystemStatus
    if (global_blade_voltage_mv > 5000) { 
        int32_t minLimitMv = (int32_t)currentSettings.bladeMinShutdownVoltage * 10;
        int32_t maxLimitMv = (int32_t)currentSettings.bladeHighVoltage * 10;

        if (global_blade_voltage_mv < minLimitMv || global_blade_voltage_mv > maxLimitMv) {
            if (bladeVoltErrorTime == 0) bladeVoltErrorTime = now;
            if (now - bladeVoltErrorTime > SAFETY_TRIGGER_DELAY && currentBladeState != BLADE_OFF) {
                debugPrintf("!!! BLADE STOP: Voltage %d mV Persistent Error! Relay OFF.\n", global_blade_voltage_mv);
                triggerSkill(6, -1);
            }
        } else { bladeVoltErrorTime = 0; }
    }
}

void resetHorizon() {
    yawOffset = ypr[0] * 180 / M_PI;
    pitchOffset = ypr[1] * 180 / M_PI;
    rollOffset = ypr[2] * 180 / M_PI;
    // ====================================================================================
    // ===== CHANGE START: Added capsize timer reset to horizon calibration =============
    // ====================================================================================
    capsizeDetectTime = 0; // Also reset the capsize detection timer to prevent false triggers after reset
    // ====================================================================================
    // ===== CHANGE END: End of timer reset =============================================
    // ====================================================================================
    DEBUG_LOG("Horizon reset: All angles set to 0°.");
}

void resetAll() {
    currentCase = 0;
    monitorDirection = false;
    holdLine = false;
    turnDirection = 0;
    skillActive = false;
    currentSkill = 0;
    skillSteer = 0;
    input_EspNowSpeed = 0;
    input_EspNowSteer = 0;
    capsizeDetectTime = 0;
    lastError = 0.0f;
    lastPdTime = 0;

    // Blade Unit auf Stand-by (1500)
    digitalWrite(BLADE_UNIT_PIN, HIGH); 
    currentBladeState = BLADE_WORK;
    current_blade_pwm = BLADE_ZERO_US;

    DEBUG_LOG("System reset: All states cleared.");
}

// ====================================================================================
// ===== PHASE 3 REFACTORING: Helper Functions ========================================
// ====================================================================================

/**
 * @brief Normalizes an angle to the range [-180, 180] degrees.
 * @param angle The input angle in degrees
 * @return The normalized angle in range [-180, 180]
 */
inline float normalizeAngle(float angle) {
    while (angle > 180.0f) angle -= 360.0f;
    while (angle < -180.0f) angle += 360.0f;
    return angle;
}

/**
 * @brief Calculates the shortest angular difference between two angles.
 * @param from Start angle in degrees
 * @param to Target angle in degrees
 * @return The signed difference in range [-180, 180]
 */
inline float angleDifference(float from, float to) {
    float diff = to - from;
    return normalizeAngle(diff);
}

/**
 * @brief PD-Controller calculation for steering correction.
 * Extracted from monitorDirectionChange and holdTheLine (Phase 3.1).
 *
 * @param error The current error value (deviation from target)
 * @param Kp Proportional gain
 * @param Kd Derivative gain
 * @param maxSteer Maximum steering output limit
 * @return The calculated steering value, constrained to [-maxSteer, maxSteer]
 */
int16_t calculatePDSteer(float error, float Kp, float Kd, int16_t maxSteer) {
    unsigned long now = millis();
    unsigned long timeDelta = now - lastPdTime;

    // Prevent division by zero (thread-safe with < 1)
    if (lastPdTime == 0 || timeDelta < 1) {
        timeDelta = 1;
    }

    // Calculate derivative (rate of error change)
    float derivative = (error - lastError) / (float)timeDelta;

    // PD output
    float pdOutput = (Kp * error) + (Kd * derivative);

    // Store state for next iteration
    lastError = error;
    lastPdTime = now;

    // Constrain and return
    return constrain((int16_t)pdOutput, -maxSteer, maxSteer);
}

// ====================================================================================

// ÄNDERN Sie die Funktion "monitorDirectionChange"
void monitorDirectionChange(float yaw) {
    float rectangleError = fmod(targetAngle - yaw + 540, 360) - 180;

    // Fix für 180-Grad-Drehung
    if (turnDirection == 1 && rectangleError < -90) rectangleError += 360;
    else if (turnDirection == -1 && rectangleError > 90) rectangleError -= 360;

    // PD-Controller (Phase 3.1: Extracted to helper function)
    skillSteer = calculatePDSteer(rectangleError, currentSettings.Kp, currentSettings.Kd, currentSettings.currentMaxSteer);

    if (ENABLE_DEBUG_SERIAL && (millis() - lastSerialUpdate >= 500)) {
        lastSerialUpdate = millis();
        DEBUG_PRINTF("Yaw: %.1f, Err: %.1f, Steer: %d\n", yaw, rectangleError, skillSteer);
    }

