Dolomonti/ESP32s3-Lawnmower/src/main.cpp
            String jsonString;
            serializeJson(doc, jsonString);
            ws.textAll(jsonString); 
        }
    }
}

// Task 5.5: EEPROM Speicher-Task (asynchrones Speichern außerhalb des Web-Threads)
void nvsSaveTask(void *pvParameters) {
    // Phase 1.2: Asynchrones Speichern in NVS (mit Wear-Leveling)
    for (;;) {
        if (settingsNeedSave) {
            if (saveSettings()) {
                DEBUG_LOG("Settings saved successfully (async NVS)");
            } else {
                DEBUG_LOG("ERROR: Failed to save settings (async NVS)");
            }
            settingsNeedSave = false;
        }
        vTaskDelay(100 / portTICK_PERIOD_MS); // Prüfe alle 100ms
    }
}

extern const char webpage_part1[] PROGMEM;
extern const char webpage_part2[] PROGMEM;

void handleWebpage(AsyncWebServerRequest *request) {
    // Wir senden die Antwort "gestückelt" (Chunked Response)
    AsyncWebServerResponse *response = request->beginChunkedResponse("text/html", [](uint8_t *buffer, size_t maxLen, size_t index) -> size_t {
        
        // Gesamtlänge beider Teile
        size_t len1 = strlen_P(webpage_part1);
        size_t len2 = strlen_P(webpage_part2);
        size_t totalLen = len1 + len2;

        // Wenn wir alles gesendet haben, gib 0 zurück (Ende)
        if (index >= totalLen) {
            return 0;
        }

        // Berechne, wie viel wir in diesem "Chunk" senden können
        size_t bytesRemaining = totalLen - index;
        size_t bytesToSend = (bytesRemaining < maxLen) ? bytesRemaining : maxLen;

        // Daten kopieren
        for (size_t i = 0; i < bytesToSend; i++) {
            size_t currentPos = index + i;
            if (currentPos < len1) {
                // Wir sind noch im ersten Teil
                buffer[i] = pgm_read_byte(webpage_part1 + currentPos);
            } else {
                // Wir sind im zweiten Teil
                buffer[i] = pgm_read_byte(webpage_part2 + (currentPos - len1));
            }
        }
        return bytesToSend;
    });

    request->send(response);
}